#ifndef MAIN_H
#define MAIN_H

#include "debug/logger.h"
#include "types/offset.h"
#include "types/structs.h"
#include "utils/utils.h"
#include "utils/branding.h"

#include "utils/process.h"
#include "utils/memory.h"
#include "utils/ue4.h"
#include "utils/socket_server.h"
#include "utils/socket_client.h"
#include "utils/touch.h"

#include "native/a_native_window_creator.h"
#include "native/imgui_renderer.h"

#include "imgui/imgui.h"
#include "imgui/backends/imgui_impl_android.h"
#include "imgui/backends/imgui_impl_opengl3.h"

#include <sstream>
#include <thread>
#include <atomic>
#include <chrono>
#include <functional>
#include <thread>
#ifdef __ANDROID__
#include <pthread.h>
#include <sys/resource.h>
#endif

void scanner_thread();
void rendering_thread();

std::unordered_map<int, std::string> player_states = {
    // Standing
    {8, "Idle"},
    {521, "Aim Down Sight"},
    {648, "Shooting"},
    {649, "Shooting"},
    {1032, "Peek"},
    {1033, "Peek"},
    {136, "Shooting"},
    {137, "Shooting"},
    {139, "Shooting"},
    {1160, "Peek"},
    {1161, "Peek"},
    {1544, "ADS"},
    {1545, "ADS"},
    {1672, "Shooting"},
    {1673, "Shooting"},
    {8200, "Punch"},
    {8201, "Punch"},
    {8203, "Punch"},
    {267, "Reload"},
    {17417, "Throw Grenade"},

    // Crouching
    {16, "Crouch"},
    {17, "Shooting"},
    {147, "Shooting"},
    {656, "Shooting"},
    {657, "Shooting"},
    {1040, "Peek"},
    {1041, "Peek"},
    {528, "ADS"},
    {529, "ADS"},
    {1168, "Shooting"},
    {1169, "Shooting"},
    {1552, "ADS"},
    {1553, "ADS"},
    {1680, "Shooting"},
    {1681, "Shooting"},
    {8209, "Punch"},
    {275, "Reload"},
    {2064, "Weapon Switch"},
    {16401, "Throw Grenade"},
    {17425, "Throw Grenade"},
    {65553, "Healing"},

    // Prone
    {32, "Prone"},
    {33, "Prone"},
    {34, "Prone"},
    {35, "Prone"},
    {544, "ADS"},
    {545, "ADS"},
    {672, "Shooting"},
    {289, "Reload"},
    {291, "Reload"},
    {16417, "Throw Grenade"},

    // Jumping
    {72, "Jump"},
    {73, "Jump"},
    {75, "Jump"},
    {8264, "Jump Punch"},
    {8265, "Jump Punch"},
    {8267, "Jump Punch"},
    {203, "Shooting"},
    {331, "Reload"},

    // Vehicle
    {524296, "Driving"},
    {1048584, "Stationary"},
    {3145736, "Peek"},
    {3145864, "Shooting"},
    {3146248, "ADS"},
    {3146376, "Shooting"},
    {3145992, "Reload"},
    {3162120, "Throw Grenade"},

    // Swimming
    {4194305, "Swimming"},
    {4194307, "Swimming"},

    // Miscellaneous
    {16777226, "Climbing"},
    {10, "Run + Jump"},
    {8202, "Jump Punch"},
    {268435464, "Dancing"},
    {1073741832, "Idle Standing"},

    {329, "Reload"},
    {328, "Reload"},
    {288, "Reload"},
    {272, "Reload"},
    {273, "Reload"},
    {264, "Reload"},
    {265, "Reload"},

    {9, "Walking"},
    {11, "Running"},
    {16777224, "Vaulting"},

    {16392, "Throw Grenade"},
    {17416, "Throw Grenade"},
    {16400, "Throw Grenade"},
    {17424, "Throw Grenade"},
    {16416, "Throw Grenade"},
    {16456, "Throw Grenade"},
    {16393, "Throw Grenade"},
    {16457, "Throw Grenade"},

    {520, "ADS"},
    {65545, "Healing"},

    {200, "Jump with Weapon"},
    {201, "Jump with Weapon"},

    {144, "Crouching"},
    {145, "Crouching"},

    {160, "Prone"},
    {8208, "Crouch Punch"},
    {8211, "Crouch Run"},
    {19, "Crouch Run"},

    {131072, "Knocked"},
    {524303, "Knocked"},
    {524304, "Knocked"},
    {524289, "Knocked"},

    {2056, "Switch Weapon"},
    {2057, "Switch Weapon"},
    {2059, "Switch Weapon"},
    {2065, "Switch Weapon"},
    {2067, "Switch Weapon"},
    {2081, "Switch Weapon"},
    {2080, "Switch Weapon"},
    {2083, "Switch Weapon"},
    {2121, "Switch Weapon"},
    {2120, "Switch Weapon"},
    {2123, "Switch Weapon"},

    {4194304, "Swimming"},
    {65544, "Healing"},
    {65552, "Healing"},
    {65568, "Healing"},
};

std::unordered_map<int, std::string> player_weapon =
    {
        {101008, "M762"},  // M762
        {1010081, "M762"}, // M762破损
        {1010082, "M762"}, // M762修复
        {1010083, "M762"}, // M762完好
        {1010084, "M762"}, // M762改进
        {1010085, "M762"}, // M762精制
        {1010086, "M762"}, // M762独眼
        {1010087, "M762"}, // M762钢铁
        {101001, "AKM"},   // AKM
        {1010011, "AKM"},  // AKM破损
        {1010012, "AKM"},  // AKM修复
        {1010013, "AKM"},  // AKM完好
        {1010014, "AKM"},  // AKM改进
        {1010015, "AKM"},  // AKM精制
        {1010016, "AKM"},  // AKM独眼
        {1010017, "AKM"},  // AKM钢铁
        {101004, "M416"},  // M416
        {1010041, "M416"}, // M416破损
        {1010042, "M416"}, // M416修复

        {1010043, "M416"}, // M416完好
        {1010044, "M416"}, // M416改进

        {1010045, "M416"}, // M416精制
        {1010046, "M416"}, // M416独眼

        {1010047, "M416"}, // M416钢铁

        {101003, "SCAR_L"}, // SCAR_L

        {1010031, "SCAR_L"}, // SCAR_L破损
        {1010032, "SCAR_L"}, // SCAR_L修复

        {1010033, "SCAR_L"}, // SCAR_L完好

        {1010034, "SCAR_L"}, // SCAR_L改进

        {1010035, "SCAR_L"}, // SCAR_L精制

        {1010036, "SCAR_L"}, // SCAR_L独眼

        {1010037, "SCAR_L"}, // SCAR_L钢铁

        {101002, "M16A4"}, // M16A4

        {1010021, "M16A4"}, // M16A4破损

        {1010022, "M16A4"}, // M16A4修复

        {1010023, "M16A4"}, // M16A4完好

        {1010024, "M16A4"}, // M16A4改进

        {1010025, "M16A4"}, // M16A4精制

        {1010026, "M16A4"}, // M16A4独眼

        {1010027, "M16A4"}, // M16A4钢铁

        {101009, "MK47"}, // MK47

        {1010091, "MK47"}, // MK47破损

        {1010092, "MK47"}, // MK47修复

        {1010093, "MK47"}, // MK47完好

        {1010094, "MK47"}, // MK47改进

        {1010095, "MK47"}, // MK47精制

        {1010096, "MK47"}, // MK47独眼

        {1010097, "MK47"}, // MK47钢铁

        {101006, "AUG"}, // AUG

        {1010061, "AUG"}, // AUG破损

        {1010062, "AUG"}, // AUG修复

        {1010063, "AUG"}, // AUG完好

        {1010064, "AUG"}, // AUG改进

        {1010065, "AUG"}, // AUG精制

        {1010066, "AUG"}, // AUG独眼

        {1010067, "AUG"}, // AUG钢铁

        {101005, "Dog"}, // 狗砸

        {1010051, "Dog"}, // 狗砸破损

        {1010052, "Dog"}, // 狗砸修复

        {1010053, "Dog"}, // 狗砸完好

        {1010054, "Dog"}, // 狗砸改进

        {1010055, "Dog"}, // 狗砸精制

        {1010056, "Dog"}, // 狗砸独眼

        {1010057, "Dog"}, // 狗砸钢铁

        {101010, "G36C"}, // G36C

        {1010101, "G36C"}, // G36C破损

        {1010102, "G36C"}, // G36C修复

        {1010103, "G36C"}, // G36C完好

        {1010104, "G36C"}, // G36C改进

        {1010105, "G36C"}, // G36C精制

        {1010106, "G36C"}, // G36C独眼

        {1010107, "G36C"}, // G36C钢铁

        {101007, "QBZ"}, // QBZ

        {1010071, "QBZ"}, // QBZ破损

        {1010072, "QBZ"}, // QBZ修复

        {1010073, "QBZ"}, // QBZ完好

        {1010074, "QBZ"}, // QBZ改进

        {1010075, "QBZ"}, // QBZ精制

        {1010076, "QBZ"}, // QBZ独眼

        {1010077, "QBZ"}, // QBZ钢铁

        {101011, "AC_VAL"}, // AC_VAL

        {1010111, "AC_VAL"}, // AC_VAL破损

        {1010112, "AC_VAL"}, // AC_VAL修复

        {1010113, "AC_VAL"}, // AC_VAL完好

        {1010114, "AC_VAL"}, // AC_VAL改进

        {1010115, "AC_VAL"}, // AC_VAL精制

        {1010116, "AC_VAL"}, // AC_VAL独眼

        {1010117, "AC_VAL"}, // AC_VAL钢铁

        {101012, "Honey Badger"}, // 蜜獾突击步枪

        {1010121, "Honey Badger"}, // 蜜獾突击步枪破损

        {1010122, "Honey Badger"}, // 蜜獾突击步枪修复

        {1010123, "Honey Badger"}, // 蜜獾突击步枪完好

        {1010124, "Honey Badger"}, // 蜜獾突击步枪改进

        {1010125, "Honey Badger"}, // 蜜獾突击步枪精制

        {1010126, "Honey Badger"}, // 蜜獾突击步枪独眼

        {1010127, "Honey Badger"}, // 蜜獾突击步枪钢铁

        // 连狙
        {103009, "SLR"}, // SLR

        {1030091, "SLR"}, // SLR破损

        {1030092, "SLR"}, // SLR修复

        {1030093, "SLR"}, // SLR完好

        {1030094, "SLR"}, // SLR改进

        {1030095, "SLR"}, // SLR精制

        {1030096, "SLR"}, // SLR独眼

        {1030097, "SLR"}, // SLR钢铁

        {103005, "VSS"}, // VSS

        {1030051, "VSS"}, // VSS破损

        {1030052, "VSS"}, // VSS修复

        {1030053, "VSS"}, // VSS完好

        {1030054, "VSS"}, // VSS改进

        {1030055, "VSS"}, // VSS精制

        {1030056, "VSS"}, // VSS独眼

        {1030057, "VSS"}, // VSS钢铁

        {103006, "Mini14"}, // Mini14

        {1030061, "Mini14"}, // Mini14破损

        {1030062, "Mini14"}, // Mini14修复

        {1030063, "Mini14"}, // Mini14完好

        {1030064, "Mini14"}, // Mini14改进

        {1030065, "Mini14"}, // Mini14精制

        {1030066, "Mini14"}, // Mini14独眼

        {1030067, "Mini14"}, // Mini14钢铁

        {103010, "QBU"}, // QBU

        {1030101, "QBU"}, // QBU破损

        {1030102, "QBU"}, // QBU修复

        {1030103, "QBU"}, // QBU完好

        {1030104, "QBU"}, // QBU改进

        {1030105, "QBU"}, // QBU精制

        {1030106, "QBU"}, // QBU独眼

        {1030107, "QBU"}, // QBU钢铁

        {103004, "SKS"}, // SKS

        {1030041, "SKS"}, // SKS破损

        {1030042, "SKS"}, // SKS修复

        {1030043, "SKS"}, // SKS完好

        {1030044, "SKS"}, // SKS改进

        {1030045, "SKS"}, // SKS精制

        {1030046, "SKS"}, // SKS独眼

        {1030047, "SKS"}, // SKS钢铁

        {103007, "MK14"}, // MK14

        {1030071, "MK14"}, // MK14破损

        {1030072, "MK14"}, // MK14修复

        {1030073, "MK14"}, // MK14完好

        {1030074, "MK14"}, // MK14改进

        {1030075, "MK14"}, // MK14精制

        {1030076, "MK14"}, // MK14独眼

        {1030077, "MK14"}, // MK14钢铁

        {103014, "MK20_H"}, // MK20_H

        {1030141, "MK20_H"}, // MK20_H破损

        {1030142, "MK20_H"}, // MK20_H修复

        {1030143, "MK20_H"}, // MK20_H完好

        {1030144, "MK20_H"}, // MK20_H改进

        {1030145, "MK20_H"}, // MK20_H精制

        {1030146, "MK20_H"}, // MK20_H独眼

        {1030147, "MK20_H"}, // MK20_H钢铁

        {103013, "M417"}, // M417

        {1030131, "M417"}, // M417破损

        {1030132, "M417"}, // M417修复

        {1030133, "M417"}, // M417完好

        {1030134, "M417"}, // M417改进

        {1030135, "M417"}, // M417精制

        {1030136, "M417"}, // M417独眼

        {1030137, "M417"}, // M417钢铁

        // 连狙
        {103012, "AMR"}, // AMR

        {1030121, "AMR"}, // AMR破损

        {1030122, "AMR"}, // AMR修复

        {1030123, "AMR"}, // AMR完好

        {1030124, "AMR"}, // AMR改进

        {1030125, "AMR"}, // AMR精制

        {1030126, "AMR"}, // AMR独眼

        {1030127, "AMR"}, // AMR钢铁

        {1030127, "AMR"}, // AMR钢铁

        {103003, "AWM"}, // AWM

        {1030031, "AWM"}, // AWM破损

        {1030032, "AWM"}, // AWM修复

        {1030033, "AWM"}, // AWM完好

        {1030034, "AWM"}, // AWM改进

        {1030035, "AWM"}, // AWM精制

        {1030036, "AWM"}, // AWM独眼

        {1030037, "AWM"}, // AWM钢铁

        {103002, "M24"}, // M24

        {1030021, "M24"}, // M24破损

        {1030022, "M24"}, // M24修复

        {1030023, "M24"}, // M24完好

        {1030024, "M24"}, // M24改进

        {1030026, "M24"}, // M24独眼

        {1030027, "M24"}, // M24钢铁

        {103011, "Mosin"}, // 莫辛纳甘

        {1030111, "Mosin"}, // 莫辛纳甘破损

        {1030112, "Mosin"}, // 莫辛纳甘修复

        {1030113, "Mosin"}, // 莫辛纳甘完好

        {1030114, "Mosin"}, // 莫辛纳甘改进

        {1030115, "Mosin"}, // 莫辛纳甘精制

        {1030116, "Mosin"}, // 莫辛纳甘独眼

        {1030117, "Mosin"}, // 莫辛纳甘钢铁

        {103001, "98K"}, // 98K

        {1030011, "98K"}, // 98K破损

        {1030012, "98K"}, // 98K修复

        {1030013, "98K"}, // 98K完好

        {1030014, "98K"}, // 98K改进

        {1030015, "98K"}, // 98K精制

        {1030016, "98K"}, // 98K独眼

        {1030017, "98K"}, // 98K钢铁

        {103008, "Win94"}, // Win94

        {1030081, "Win94"}, // Win94破损

        {1030082, "Win94"}, // Win94修复

        {1030083, "Win94"}, // Win94完好

        {1030084, "Win94"}, // Win94改进

        {1030085, "Win94"}, // Win94精制

        {1030086, "Win94"}, // Win94独眼

        {1030087, "Win94"}, // Win94钢铁

        // 机关枪
        {105001, "M249"}, // M249

        {1050011, "M249"}, // M249破损

        {1050012, "M249"}, // M249修复

        {1050013, "M249"}, // M249完好

        {1050014, "M249"}, // M249改进

        {1050015, "M249"}, // M249精制

        {1050016, "M249"}, // M249独眼

        {1050017, "M249"}, // M249钢铁

        {105002, "DP_28"}, // DP_28

        {1050021, "DP_28"}, // DP_28破损

        {1050022, "DP_28"}, // DP_28修复

        {1050023, "DP_28"}, // DP_28完好

        {1050024, "DP_28"}, // DP_28改进

        {1050025, "DP_28"}, // DP_28精制

        {1050026, "DP_28"}, // DP_28独眼

        {1050027, "DP_28"}, // DP_28钢铁

        {105010, "MG3"}, // MG3

        {1050101, "MG3"}, // MG3破损

        {1050102, "MG3"}, // MG3修复

        {1050103, "MG3"}, // MG3完好

        {1050104, "MG3"}, // MG3改进

        {1050105, "MG3"}, // MG3精制

        {1050106, "MG3"}, // MG3独眼

        {1050107, "MG3"}, // MG3钢铁

        {107001, "Crossbow"}, // 十字弩

        {1070011, "Crossbow"}, // 十字弩破损

        {1070012, "Crossbow"}, // 十字弩修复

        {1070013, "Crossbow"}, // 十字弩完好

        {1070014, "Crossbow"}, // 十字弩改进

        {1070015, "Crossbow"}, // 十字弩精制

        {1070016, "Crossbow"}, // 十字弩独眼

        {1070017, "Crossbow"}, // 十字弩钢铁

        {107007, "ExplosiveBow"}, // 爆炸猎弓

        {1070071, "ExplosiveBow"}, // 爆炸猎弓破损

        {1070072, "ExplosiveBow"}, // 爆炸猎弓修复

        {1070073, "ExplosiveBow"}, // 爆炸猎弓完好

        {1070074, "ExplosiveBow"}, // 爆炸猎弓改进

        {1070075, "ExplosiveBow"}, // 爆炸猎弓精制

        {1070076, "ExplosiveBow"}, // 爆炸猎弓独眼

        {1070077, "ExplosiveBow"}, // 爆炸猎弓钢铁

        // 冲锋枪
        {102001, "UZI"}, // UZI

        {1020011, "UZI"}, // UZI破损

        {1020012, "UZI"}, // UZI修复

        {1020013, "UZI"}, // UZI完好

        {1020014, "UZI"}, // UZI改进

        {1020015, "UZI"}, // UZI精制

        {1020016, "UZI"}, // UZI独眼

        {1020017, "UZI"}, // UZI钢铁

        {102003, "Victor"}, // 维克托

        {1020031, "Victor"}, // 维克托破损

        {1020032, "Victor"}, // 维克托修复

        {1020033, "Victor"}, // 维克托完好

        {1020034, "Victor"}, // 维克托改进

        {1020035, "Victor"}, // 维克托精制

        {1020036, "Victor"}, // 维克托独眼

        {1020037, "Victor"}, // 维克托钢铁

        {100103, "PP_19"}, // 野牛 PP_19

        {1001031, "PP_19"}, // 野牛 PP_19破损

        {1001032, "PP_19"}, // 野牛 PP_19修复

        {1001033, "PP_19"}, // 野牛 PP_19完好

        {1001034, "PP_19"}, // 野牛 PP_19改进

        {1001035, "PP_19"}, // 野牛 PP_19精制

        {1001036, "PP_19"}, // 野牛 PP_19独眼

        {1001037, "PP_19"}, // 野牛 PP_19钢铁

        {102007, "MP5K"}, // MP5K

        {1020071, "MP5K"}, // MP5K破损

        {1020072, "MP5K"}, // MP5K修复

        {1020073, "MP5K"}, // MP5K完好

        {1020073, "MP5K"}, // MP5K完好

        {1020074, "MP5K"}, // MP5K改进

        {1020075, "MP5K"}, // MP5K精制

        {1020076, "MP5K"}, // MP5K独眼

        {1020077, "MP5K"}, // MP5K钢铁

        {102002, "UMP45"}, // UMP45

        {1020021, "UMP45"}, // UMP45破损

        {1020022, "UMP45"}, // UMP45修复

        {1020023, "UMP45"}, // UMP45完好

        {1020024, "UMP45"}, // UMP45改进

        {1020025, "UMP45"}, // UMP45精制

        {1020026, "UMP45"}, // UMP45独眼

        {1020027, "UMP45"}, // UMP45钢铁

        {1020023, "UMP45"}, // UMP45完好

        {1020024, "UMP45"}, // UMP45改进

        {1020025, "UMP45"}, // UMP45精制

        {1020025, "UMP45"}, // UMP45精制

        {1020026, "UMP45"}, // UMP45独眼

        {1020027, "UMP45"}, // UMP45钢铁

        {1020027, "UMP45"}, // UMP45钢铁

        {102004, "Thomson"}, // 汤姆逊

        {1020041, "Thomson"}, // 汤姆逊破损

        {1020042, "Thomson"}, // 汤姆逊修复

        {1020043, "Thomson"}, // 汤姆逊完好

        {1020044, "Thomson"}, // 汤姆逊改进

        {1020045, "Thomson"}, // 汤姆逊精制

        {1020046, "Thomson"}, // 汤姆逊独眼

        {1020047, "Thomson"}, // 汤姆逊钢铁

        {102105, "P90"}, // P90

        {1021051, "P90"}, // P90破损

        {1021052, "P90"}, // P90修复

        {1021053, "P90"}, // P90完好

        {1021054, "P90"}, // P90改进

        {1021055, "P90"}, // P90精制

        {1021056, "P90"}, // P90独眼

        {1021057, "P90"}, // P90钢铁

        {102005, "Bison"}, // 野牛

        {1020051, "Bison"}, // 野牛破损

        {1020052, "Bison"}, // 野牛修复

        {1020053, "Bison"}, // 野牛完好

        {1020054, "Bison"}, // 野牛改进

        {1020055, "Bison"}, // 野牛精制

        {1020056, "Bison"}, // 野牛独眼

        {1020057, "Bison"}, // 野牛钢铁

        // 霰弹枪
        {104001, "S686"}, // S686

        {1040011, "S686"}, // S686破损

        {1040012, "S686"}, // S686修复

        {1040013, "S686"}, // S686完好

        {1040014, "S686"}, // S686改进

        {1040015, "S686"}, // S686精制

        {1040016, "S686"}, // S686独眼

        {1040017, "S686"}, // S686钢铁

        {104002, "S1897"}, // S1897

        {1040021, "S1897"}, // S1897破损

        {1040022, "S1897"}, // S1897修复

        {1040023, "S1897"}, // S1897完好

        {1040024, "S1897"}, // S1897改进

        {1040025, "S1897"}, // S1897精制

        {1040026, "S1897"}, // S1897独眼

        {1040027, "S1897"}, // S1897钢铁

        {104003, "S12K"}, // S12K

        {1040031, "S12K"}, // S12K破损

        {1040032, "S12K"}, // S12K修复

        {1040033, "S12K"}, // S12K完好

        {1040034, "S12K"}, // S12K改进

        {1040035, "S12K"}, // S12K精制

        {1040036, "S12K"}, // S12K独眼

        {1040037, "S12K"}, // S12K钢铁

        {104004, "DBS"}, // DBS

        {1040041, "DBS"}, // DBS破损

        {1040042, "DBS"}, // DBS修复

        {1040043, "DBS"}, // DBS完好

        {1040044, "DBS"}, // DBS改进

        {1040045, "DBS"}, // DBS精制

        {1040046, "DBS"}, // DBS独眼

        {1040047, "DBS"}, // DBS钢铁

        {104100, "SPAS_12"}, // SPAS_12 没有

        {1041001, "SPAS_12"}, // SPAS_12破损

        {1041003, "SPAS_12"}, // SPAS_12完好

        {1041004, "SPAS_12"}, // SPAS_12改进

        {1041005, "SPAS_12"}, // SPAS_12精制

        {1041006, "SPAS_12"}, // SPAS_12独眼

        {1041007, "SPAS_12"}, // SPAS_12钢铁

        // 投掷爆炸物
        {602001, "Flash"}, // 闪光弹

        {602002, "Smoke"}, // 烟雾弹

        {602003, "Molotov"}, // 燃烧瓶

        {602004, "Grenade"}, // 手榴弹

        // 近战武器
        {108001, "Dagger"}, // 砍刀

        {108002, "Crowbar"}, // 撬棍

        {108003, "Scythe"}, // 镰刀

        {108004, "Pan"}, // 平底锅

        {0, "Fist"}, // 拳头

        {9808001, "P92"}, // P92手枪破损

        {9808002, "P92"}, // P92手枪修复

        {9808003, "P92"}, // P92手枪完好

        {9808008, "P1911"}, // P1911手枪破损

        {9808009, "P1911"}, // P1911手枪修复

        {9808010, "P1911"}, // P1911手枪完好

        {9808015, "Revolver"}, // 左轮手枪破损

        {9808016, "Revolver"}, // 左轮手枪修复

        {9808017, "Restoration"}, // 左轮手枪完好

        {9808022, "P18C"}, // P18C手枪破损

        {9808023, "P18C"}, // P18C手枪修复

        {9808024, "P18C"}, // P18C手枪修复

        {9808029, "R45"}, // R45手枪破损

        {9808030, "R45"}, // R45手枪修复

        {9808031, "R45"}, // R45手枪完好

        {9808036, "Broken sawn-off shotgun"}, // 短管霰弹枪破损

        {9808037, "Sawed-off shotgun"}, // 短管霰弹枪修复

        {9808038, "Sawed-off shotgun in good condition"}, // 短管霰弹枪完好

        {9808043, "Scorpion Pistol Repair"}, // 蝎式手枪修复

        {9808044, "Scorpion Pistol in good condition"}, // 蝎式手枪完好

        {9808045, "Scorpion Pistol improvement"}, // 蝎式手枪改进

        {9808046, "Scorpion Pistol broken"}, // 蝎式手枪破损

        {9808050, "Desert Eagle Pistol Repair"}, // 沙漠之鹰手枪修复

        {9808051, "Desert Eagle Pistol in good condition"}, // 沙漠之鹰手枪完好

        {9808052, "Desert Eagle Pistol improvement"}, // 沙漠之鹰手枪改进

        {9808053, "Desert Eagle Pistol"}, // 沙漠之鹰手枪破损

        {9808057, "TMP_9"}, // TMP_9手枪修复  没有

        {9808058, "TMP_9"}, // TMP_9手枪完好

        {9808059, "TMP_9"}, // TMP_9手枪改进

        {9808060, "Flare Gun"}, // 信号枪

        {9808061, "TMP_9"}, // TMP_9手枪破损

        {9809001, "Crossbow"}, // 十字弩破损

        {9809002, "Crossbow"}, // 十字弩修复

        {9809003, "Crossbow"}, // 十字弩完好

        {9809009, "Explosive Hunting Bow"}, // 爆炸猎弓骑警

        {9809010, "Explosive Hunting Bow"}, // 爆炸猎弓

        {9810001, "S686"}, // S686霰弹枪破损

        {9810002, "S686"}, // S686霰弹枪修复

        {9810003, "S686"}, // S686霰弹枪完好

        {9810008, "S1897"}, // S1897霰弹枪破损

        {9810009, "S1897"}, // S1897霰弹枪修复

        {9810010, "S1897"}, // S1897霰弹枪完好

        {9810015, "S12K"}, // S12K霰弹枪精制

        {9810016, "S12K"}, // S12K霰弹枪修复

        {9810017, "S12K"}, // S12K霰弹枪完好

        {9810018, "S12K"}, // S12K霰弹枪改进

        {9810022, "DBS"}, // DBS霰弹枪破损

        {9810023, "DBS"}, // DBS霰弹枪修复

        {9810024, "DBS"}, // DBS霰弹枪改进

        {9810025, "DBS"}, // DBS霰弹枪精制

        {9810029, "SPAS_12"}, // SPAS_12霰弹枪修复  没有

        {9810029, "SPAS_12"}, // SPAS_12霰弹枪修复  没有

        {9810030, "SPAS_12"}, // SPAS_12霰弹枪完好

        {9810031, "AA12_G"}, // AA12_G霰弹枪改进

        {9810036, "AA12_G"}, // AA12_G霰弹枪修复  没有

        {9810037, "AA12_G"}, // AA12_G霰弹枪完好

        {9810038, "AA12_G"}, // AA12_G霰弹枪改进

        {9810041, "AA12_G"}, // AA12_G霰弹枪精制

        {9811001, "UZI"}, // UZI冲锋枪破损

        {9811002, "UZI"}, // UZI冲锋枪修复

        {9811003, "UZI"}, // UZI冲锋枪完好

        {9811004, "UZI"}, // UZI冲锋枪改进

        {9811008, "UMP45"}, // UMP45冲锋枪破损

        {9811009, "UMP45"}, // UMP45冲锋枪修复

        {9811010, "UMP45"}, // UMP45冲锋枪完好

        {9811015, "Vector"}, // 维克托冲锋枪卓越

        {9811016, "Vector"}, // 维克托冲锋枪完好

        {9811017, "Vector"}, // 维克托冲锋枪改进

        {9811018, "Vector"}, // 维克托冲锋枪精制

        {9811019, "Vector"}, // 维克托冲锋枪卓越

        {9811020, "Vector"}, // 维克托冲锋枪黑鹰

        {9811021, "Vector"}, // 维克托冲锋枪铁爪

        {9811022, "Thompson"}, // 汤姆逊冲锋枪破损

        {9811023, "Thompson"}, // 汤姆逊冲锋枪修复

        {9811024, "Thompson"}, // 汤姆逊冲锋枪完好

        {9811025, "Thompson"}, // 汤姆逊冲锋枪改进

        {9811030, "M416"}, // 野牛冲锋枪修复

        {9811031, "M416"}, // 野牛冲锋枪完好

        {9811036, "MP5K"}, // MP5K冲锋枪卓越

        {9811037, "MP5K"}, // MP5K冲锋枪完好

        {9811038, "MP5K"}, // MP5K冲锋枪改进

        {9811039, "MP5K"}, // MP5K冲锋枪精制

        {9811040, "MP5K"}, // MP5K冲锋枪卓越

        {9811041, "MP5K"}, // MP5K冲锋枪黑鹰

        {9811042, "MP5K"}, // MP5K冲锋枪铁爪

        {9811043, "AKS_74U"}, // AKS_74U冲锋枪修复   没有

        {9811044, "AKS_74U"}, // AKS_74U冲锋枪完好

        {9811046, "AKS_74U"}, // AKS_74U冲锋枪精制

        {9811047, "AKS_74U"}, // AKS_74U冲锋枪卓越

        {9811048, "AKS_74U"}, // AKS_74U冲锋枪铁爪

        {9811049, "AKS_74U"}, // AKS_74U冲锋枪黑鹰

        {9811050, "P90"}, // P90冲锋枪卓越

        {9811051, "P90"}, // P90冲锋枪完好

        {9811052, "P90"}, // P90冲锋枪改进

        {9811053, "P90"}, // P90冲锋枪精制

        {9811054, "P90"}, // P90冲锋枪卓越

        {9811055, "P90"}, // P90冲锋枪黑鹰

        {9811056, "P90"}, // P90冲锋枪铁爪

        {9812003, "AKM"}, // AKM突击步枪完好

        {9812004, "AKM"}, // AKM突击步枪改进

        {9812005, "AKM"}, // AKM突击步枪精制

        {9812006, "AKM"}, // AKM突击步枪卓越

        {9812007, "AKM"}, // AKM突击步枪黑鹰

        {9812008, "AKM"}, // AKM突击步枪铁爪

        {9812009, "M16A4"}, // M16A4突击步枪破损

        {9812010, "M16A4"}, // M16A4突击步枪修复

        {9812011, "M16A4"}, // M16A4突击步枪完好

        {9812012, "M16A4"}, // M16A4突击步枪改进

        {9812015, "SCAR_L"}, // SCAR_L突击步枪卓越

        {9812016, "SCAR_L"}, // SCAR_L突击步枪完好

        {9812017, "SCAR_L"}, // SCAR_L突击步枪改进

        {9812018, "SCAR_L"}, // SCAR_L突击步枪精制

        {9812019, "SCAR_L"}, // SCAR_L突击步枪卓越

        {9812020, "SCAR_L"}, // SCAR_L突击步枪黑鹰

        {9812021, "SCAR_L"}, // SCAR_L突击步枪铁爪

        {9812022, "M416"}, // M416突击步枪铁爪

        {9812023, "M416"}, // M416突击步枪卓越

        {9812024, "M416"}, // M416突击步枪完好

        {9812025, "M416"}, // M416突击步枪改进

        {9812026, "M416"}, // M416突击步枪精制

        {9812028, "M416"}, // M416突击步枪黑鹰

        {9812029, "Dog_A"}, // 狗砸突击步枪卓越

        {9812030, "Dog_A"}, // 狗砸突击步枪改进

        {9812031, "Dog_A"}, // 狗砸突击步枪精制

        {9812032, "Dog_A"}, // 狗砸突击步枪卓越

        {9812033, "Dog_A"}, // 狗砸突击步枪黑鹰

        {9812034, "Dog_A"}, // 狗砸突击步枪铁爪

        {9812036, "AUG"}, // AUG突击步枪卓越

        {9812037, "AUG"}, // AUG突击步枪改进

        {9812038, "AUG"}, // AUG突击步枪精制

        {9812039, "AUG"}, // AUG突击步枪卓越

        {9812040, "AUG"}, // AUG突击步枪黑鹰

        {9812044, "QBZ"}, // QBZ突击步枪完好

        {9812045, "QBZ"}, // QBZ突击步枪改进

        {9812046, "QBZ"}, // QBZ突击步枪精制

        {9812047, "QBZ"}, // QBZ突击步枪卓越

        {9812048, "QBZ"}, // QBZ突击步枪黑鹰

        {9812049, "QBZ"}, // QBZ突击步枪铁爪

        {9812050, "M762"}, // M762突击步枪卓越

        {9812051, "M762"}, // M762突击步枪完好

        {9812052, "M762"}, // M762突击步枪改进

        {9812053, "M762"}, // M762突击步枪精制

        {9812054, "M762"}, // M762突击步枪卓越

        {9812055, "M762"}, // M762突击步枪黑鹰

        {9812056, "M762"}, // M762突击步枪铁爪

        {9812057, "MK47"}, // MK47突击步枪破损

        {9812058, "MK47"}, // MK47突击步枪修复

        {9812059, "MK47"}, // MK47突击步枪完好

        {9812060, "MK47"}, // MK47突击步枪改进

        {9812064, "G36C"}, // G36C突击步枪卓越

        {9812066, "G36C"}, // G36C突击步枪改进

        {9812067, "G36C"}, // G36C突击步枪精制

        {9812068, "G36C"}, // G36C突击步枪卓越

        {9812069, "G36C"}, // G36C突击步枪黑鹰

        {9812070, "G36C"}, // G36C突击步枪铁爪

        {9812071, "AC_VAL"}, // AC_VAL突击步枪破损

        {9812072, "AC_VAL"}, // AC_VAL突击步枪修复

        {9812073, "AC_VAL"}, // AC_VAL突击步枪完好

        {9812074, "AC_VAL"}, // AC_VAL突击步枪改进

        {9812078, "AC_VAL"}, // 蜜獾突击步枪卓越

        {9812079, "AC_VAL"}, // 蜜獾突击步枪完好

        {9812080, "AC_VAL"}, // 蜜獾突击步枪改进

        {9812081, "AC_VAL"}, // 蜜獾突击步枪精制

        {9812082, "AC_VAL"}, // 蜜獾突击步枪卓越

        {9812084, "AC_VAL"}, // 蜜獾突击步枪铁爪

        {9812085, "FAMAS"}, // FAMAS突击步枪卓越  没有

        {9812086, "FAMAS"}, // FAMAS突击步枪完好

        {9812087, "FAMAS"}, // FAMAS突击步枪改进

        {9812088, "FAMAS"}, // FAMAS突击步枪精制

        {9812089, "FAMAS"}, // FAMAS突击步枪卓越

        {9812090, "FAMAS"}, // FAMAS突击步枪黑鹰

        {9812091, "FAMAS"}, // FAMAS突击步枪铁爪

        {9812092, "M416"}, // M416卡德

        {9813001, "M249"}, // M249轻机枪卓越

        {9813002, "M249"}, // M249轻机枪改进

        {9813003, "M249"}, // M249轻机枪精制

        {9813004, "M249"}, // M249轻机枪卓越

        {9813005, "M249"}, // M249轻机枪黑鹰

        {9813006, "M249"}, // M249轻机枪铁爪

        {9813008, "DP_28"}, // DP_28轻机枪破损

        {9813009, "DP_28"}, // DP_28轻机枪修复

        {9813010, "DP_28"}, // DP_28轻机枪完好

        {9813022, "MG3"}, // MG3轻机枪卓越

        {9813023, "MG3"}, // MG3轻机枪改进

        {9813024, "MG3"}, // MG3轻机枪精制

        {9813025, "MG3"}, // MG3轻机枪卓越

        {9813026, "MG3"}, // MG3轻机枪卓越

        {9813027, "MG3"}, // MG3轻机枪铁爪

        {9813029, "PKM"}, // PKM轻机枪卓越  没有

        {9813030, "PKM"}, // PKM轻机枪改进

        {9813031, "PKM"}, // PKM轻机枪精制

        {9813032, "PKM"}, // PKM轻机枪卓越

        {9813033, "PKM"}, // PKM轻机枪黑鹰

        {9813034, "PKM"}, // PKM轻机枪铁爪

        {9814001, "98K"}, //_98K狙击枪修复

        {9814002, "98K"}, //_98K狙击枪完好

        {9814003, "98K"}, //_98K狙击枪改进

        {9814008, "M24"}, // M24狙击枪卓越

        {9814010, "M24"}, // M24狙击枪改进

        {9814011, "M24"}, // M24狙击枪精制

        {9814012, "M24"}, // M24狙击枪卓越

        {9814014, "M24"}, // M24狙击枪铁爪

        {9814015, "AWM"}, // AWM狙击枪卓越

        {9814016, "AWM"}, // AWM狙击枪改进

        {9814017, "AWM"}, // AWM狙击枪精制

        {9814018, "AWM"}, // AWM狙击枪卓越

        {9814019, "AWM"}, // AWM狙击枪黑鹰

        {9814020, "AWM"}, // AWM狙击枪铁爪

        {9814022, "M200"}, // 莫辛纳甘狙击枪破损

        {9814023, "M200"}, // 莫辛纳甘狙击枪修复

        {9814024, "M200"}, // 莫辛纳甘狙击枪完好

        {9814029, "Win94"}, // Win94狙击枪破损

        {9814030, "Win94"}, // Win94狙击枪修复

        {9814031, "Win94"}, // Win94狙击枪完好

        {9814036, "AMR"}, // AMR狙击枪卓越

        {9814037, "AMR"}, // AMR狙击枪改进

        {9814038, "AMR"}, // AMR狙击枪精制

        {9814039, "AMR"}, // AMR狙击枪卓越

        {9814040, "AMR"}, // AMR狙击枪黑鹰

        {9814041, "AMR"}, // AMR狙击枪铁爪

        {9814043, "M200"}, // M200狙击枪卓越

        {9814044, "M200"}, // M200狙击枪完好

        {9814045, "M200"}, // M200狙击枪改进

        {9814046, "M200"}, // M200狙击枪精制

        {9814047, "M200"}, // M200狙击枪卓越

        {9814048, "M200"}, // M200狙击枪黑鹰

        {9814049, "M200"}, // M200狙击枪铁爪

        {9814050, "SVD"}, // SVD狙击枪精制

        {9814052, "SVD"}, // SVD狙击枪卓越

        {9814053, "SVD"}, // SVD狙击枪卓越

        {9815001, "SKS"}, // SKS射手步枪卓越

        {9815002, "SKS"}, // SKS射手步枪完好

        {9815003, "SKS"}, // SKS射手步枪改进

        {9815004, "SKS"}, // SKS射手步枪精制

        {9815005, "SKS"}, // SKS射手步枪卓越

        {9815006, "SKS"}, // SKS射手步枪黑鹰

        {9815007, "SKS"}, // SKS射手步枪铁爪

        {9815008, "VSS"}, // VSS射手步枪破损

        {9815009, "VSS"}, // VSS射手步枪修复

        {9815010, "VSS"}, // VSS射手步枪完好

        {9815015, "Mini14"}, // Mini14射手步枪破损

        {9815016, "Mini14"}, // Mini14射手步枪修复

        {9815017, "Mini14"}, // Mini14射手步枪完好

        {9815018, "Mini14"}, // Mini14射手步枪改进

        {9815022, "MK14"}, // MK14射手步枪卓越

        {9815023, "MK14"}, // MK14射手步枪完好

        {9815024, "MK14"}, // MK14射手步枪改进

        {9815025, "MK14"}, // MK14射手步枪精制

        {9815026, "MK14"}, // MK14射手步枪卓越

        {9815027, "MK14"}, // MK14射手步枪黑鹰

        {9815028, "MK14"}, // MK14射手步枪铁爪

        {9815029, "SLR"}, // SLR射手步枪卓越

        {9815030, "SLR"}, // SLR射手步枪完好

        {9815031, "SLR"}, // SLR射手步枪改进

        {9815032, "SLR"}, // SLR射手步枪精制

        {9815034, "SLR"}, // SLR射手步枪黑鹰

        {9815035, "SLR"}, // SLR射手步枪铁爪

        {9815036, "QBU"}, // QBU射手步枪破损

        {9815037, "QBU"}, // QBU射手步枪修复

        {9815038, "QBU"}, // QBU射手步枪完好

        {9815039, "QBU"}, // QBU射手步枪改进

        {9815043, "M417"}, // M417射手步枪卓越

        {9815045, "M417"}, // M417射手步枪改进

        {9815046, "M417"}, // M417射手步枪精制

        {9815047, "M417"}, // M417射手步枪卓越

        {9815048, "M417"}, // M417射手步枪黑鹰

        {9815049, "M417"}, // M417射手步枪铁爪

        {9815050, "MK20_H"}, // MK20_H射手步枪卓越

        {9815051, "MK20_H"}, // MK20_H射手步枪完好

        {9815052, "MK20_H"}, // MK20_H射手步枪改进

        {9815053, "MK20_H"}, // MK20_H射手步枪精制

        {9815054, "MK20_H"}, // MK20_H射手步枪卓越

        {9815056, "MK20_H"}, // MK20_H射手步枪黑鹰

        {9815057, "MK20_H"}, // MK20_H射手步枪铁爪

        {9815064, "MK12"}, // MK12射手步枪卓越

        {9815065, "MK12"}, // MK12射手步枪完好

        {9815067, "MK12"}, // MK12射手步枪精制

        {9815068, "MK12"}, // MK12射手步枪卓越

        {9815069, "MK12"}, // MK12射手步枪黑鹰

        {9815070, "MK12"}, // MK12射手步枪铁爪

};

#endif // MAIN_H